{
  "content": [
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Bobby \"Boris\" Pickett and the Crypt-Kickers's 1962 novelty Halloween song, \"Monster Mash”, is arguably one of the main catalysts for the genre of American Halloween music. Dance fads like the “Mashed Potato” inspired Pickett, an aspiring actor in Los Angeles at the time, to focus his skillset on the recording of the “Monster Mash”. The song was released as a single in August on Gary S. Paxton's Garpax Records label. A full-length LP was also created, entitled The Original Monster Mash, which contained other monster-themed songs. However, the \"Monster Mash\" was the only one to become number one on the Billboard Hot 100 chart that year."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "This project explores the many iterations of the “Monster Mash” through time, how it became the hit that it is, and what new performances of the song have done to maintain its popularity in American culture. The song’s lasting impact is evident in the various recordings, film and television inclusions, and re-releases since 1962. Nearly 60 years later, the \"Monster Mash\" re-entered the Billboard Hot 100 chart in 2021. As a result, the song has been generating $1 million annually in royalties as of 2023. The following Events that will be analyzed include Bobby Pickett’s 1964 and 1991 performances; ABC Kids, The Misfits and The Chipmunks covers of the song and performance; and contemporary videos breaking down lesser known facts and the story of the song. All of these versions and tellings of the story of the “Monster Mash” allows for cross-comparison analysis for different reasons. How the “Monster Mash” was interpreted originally versus its current iterations and relevance in society will be analyzed through annotation and comparison pages. The annotations provide a narrative for the project as well as larger themes to take away from the artifacts/objects of study. Those themes (tag categories) include different Speakers, the Form of the song, cultural and important figure Context, Structure of the song and its Impact. Ultimately, the project as a whole will demonstrate the capacity of AVAnnotate features and flow for project authors to glean from with their own work."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Citations:"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Knopper, Steve. “How Much Is 'Monster Mash' Worth?”. "
        },
        {
          "text": "Billboard",
          "italic": true
        },
        {
          "text": ", October 31, 2023. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "“Monster Mash by Bobby ‘Boris’ Pickett & the Crypt-Kickers”. "
        },
        {
          "text": "songfacts.com",
          "italic": true
        },
        {
          "text": ". Song Facts, LLC."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Vitagliano, Joe. \"Behind The Song: “‘Monster Mash,’ Bobby ‘Boris’ Pickett and the Crypt-Kickers”. "
        },
        {
          "text": "American Songwriter",
          "italic": true
        },
        {
          "text": ", October 29, 2021."
        }
      ]
    }
  ],
  "created_at": "2024-12-07T21:56:56.467Z",
  "created_by": "saamturner",
  "title": "The Monster Mash - Project Introduction",
  "updated_at": "2025-03-31T17:11:40.030Z",
  "updated_by": "Alyssaf-j",
  "autogenerate": {
    "enabled": false,
    "type": "home"
  },
  "slug": "the-monster-mash-project-introduction"
}